models/LoginForm.php

    public function getUser() {

        if ($this->_user === false) {
            $this->_user = User::findOne(['username' => Yii::$app->request->post('LoginForm')['username']]);
---
SELECT * FROM `user` WHERE `username`='admin'